using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace WebAPI
{
    public static class Emergency
    {
        public static readonly Dictionary<string, HashSet<string>> Categories = new Dictionary<string, HashSet<string>>()
            {
                {"ДТП" , new HashSet<string>()
                {
                    "водитель", "пассажир", "протаранить", "пассажирка", "пешеход",
                    "пролететь", "проехать", "наехать", "сбить", "выехать", "вылететь",
                    "столкнуться", "врезаться", "авария" , "промчаться", "обогнать",
                    "обгон", "проезжать", "наезд", "ехать","столкновение", "пересекать",
                    "скорость", "обгонять", "руль", "перекресток", "светофор", "пешеходный", "пешеходной"
                }},
                {"Пожар" , new HashSet<string>()
                {
                    "сгореть", "загореться" , "огонь", "пламя", "потушить", "воспламяниться", "гореть",
                    "пожар", "вспыхнуть", "взорваться", "возгорание", "задымление", "дым", "газ","угарный",
                    "сгорать", "горение", "отравиться", "пожарный"
                }},
                {"Физическое насилие" , new HashSet<string>()
                {
                    "орудие", "вооружаться", "сексуальный", "удержание", "избить", "пинал", "кулак", "ударять", "убивать", "убийца", "убитый",
                    "убитая", "убитые", "труп", "тело", "убийство", "вооружиться", "вооружился", "половый", "изнасилованный",
                    "вооружилась", "нож", "ранение", "раны", "рана", "зарезать", "скончаться", "удар", "ударить",
                    "конфликт", "ссора", "поссориться", "нападавший", "жестокость", "нападавшая","нападать", "жестоко",
                    "огнестрельное", "оружие", "выстрел", "стрельба", "задушить", "удушье", "удушение", "изрубить",
                    "кровь", "кровотечение", "мучить", "пытки", "пытать", "смертельный", "травмы", "сжёг", "насильственная",
                    "расправиться", "развратные", "изнасилование", "изнасиловать", "сексуальное",  "насилие", "драка",
                    "рукоприкладство", "избиение", "жертва", "избивать", "бить", "пинать", "побои", "развратный",
                    "расправляться", "рубить", "насильственный", "сжечь", "травма", "пытка", "изрубать", "топор", "огнестрельный"

                }},
                {"Кражи" , new HashSet<string>()
                {
                    "украсть", "ограбить", "кража", "грабитель", "вор", "хищение", "ограбление", "обокрасть", "похитить",
                    "взлом", "ценности", "деньга", "сумма", "техника", "украшение", "ценность", "награбить", "прилавок",
                    "сметать", "обокрасть"
                }},
                {"Суицид" , new HashSet<string>()
                {
                    "покончить", "суицид",  "самоубийство", "сброситься", "повеситься", "застрелиться",
                    "петля", "повешаться", "счеты", "сбрасываться", 
                }},
                {"ЖКХ" , new HashSet<string>()
                {
                    "авария", "прорыв","трубопровод", "водоснабжение", "ХВС",  "ГВС",
                     "коммунальный", "затопление", "теплоснабжение",  "отопление",  "труба",
                    "разрыв", "водовод", "перекрывать", "электроснабжение", "электричество", "кабельный", "повредить", "повреждение",
                    "свет", "кабельно-воздушный", "электросетевой"
                }},
                
            };
    }
}
